
answer_1 = {
          'name': 'Пламенная бригада пожарных', 
          'site_url':'https://jut.su/enen-no-shouboutai/season-1/episode-1.html',
          'photo':'https://kawai.shikimori.one/uploads/poster/animes/38671/main-57069179ee17a94bad8732fce919905b.webp',
          'description':'Несколько лет назад в Токио появились необычные люди, которые несли большую опасность общественности. С этими особыми происходило нечто мистическое, а именно спонтанное воспламенение. Огонь появлялся из тел этих людей, и всё вокруг сгорало от разрушительного пожара. Никто не мог объяснить странный феномен, и граждане города боялись появления новых самовозгорающихся особей. В скором времени их начали называть инферналами. Спустя несколько лет произошла эволюция неизученных существ и теперь этих монстров не так боятся как прежде. ',
          'rating':' 7,7/10'  
        }
anime_1 = {
          1:'Пламенная бригада пожарных',
          2:'Самурай Чамплу ',
          3:'Корона Грешника',
          4:'SABIKUI BISCO',
          5:'Убийца гоблинов',
          6:'Клинков бесконечный край',
          7:'Класс убийц',
          8:' Ковбой Бибоп',
          9:'Пожиратель душ ',
          10:'Гуррен-Лаганн'
       } 